laravel-cms/app/Http/Controllers/ArticleController.php

    public function index()
    {
        $articles = Article::with('author', 'tags', 'category')->latest()->paginate(10);
---
select * from `articles` order by `created_at` desc limit 10 offset 0
select * from `categories` where `categories`.`id` in (4, 5)
select `tags`.*, `article_tag`.`article_id` as `pivot_article_id`, `article_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `article_tag` on `tags`.`id` = `article_tag`.`tag_id` where `article_tag`.`article_id` in (34, 35, 36, 37, 38, 39, 40, 41, 42, 43)
select count(*) as aggregate from `articles`

    public function create()
    {
        $categories = Category::all();
        $tags = Tag::all();
---
select * from `categories`
select * from `tags`

    public function edit(Article $article)
    {
        Gate::authorize('update', $article);

        $categories = Category::all();
        $tags = Tag::all();
---
select * from `categories`
select * from `tags`

    public function update(ArticleRequest $request, Article $article)
    {
        $article->update([
            'title' => $request->title,
            'body' => $request->body,
            'slug' => Str::slug($request->title),
            'category_id' => $request->category,
        ]);

        if($request->file('image')){
            Storage::disk('public')->delete($article->image);

            $image = $request->file('image');
            $path = $image->store("images/articles/$article->id", 'public');
            $article->update(['image' => $path]);
        }

        if ($request->tags) {
            $article->tags()->sync($request->tags);
        }else{
            $article->tags()->detach($article->tags->pluck('id'));
---
update `articles` set `image` = 'images/articles/52/fvvCdRxdzlS93pxThebIom0zSVdrqpFzILcU5qFB.jpg', `articles`.`updated_at` = '2024-10-06 17:32:00' where `id` = 52
delete from `article_tag` where `article_tag`.`article_id` = 52 and `article_tag`.`tag_id` in (13)
select `tags`.*, `article_tag`.`article_id` as `pivot_article_id`, `article_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `article_tag` on `tags`.`id` = `article_tag`.`tag_id` where `article_tag`.`article_id` = 52

    public function destroy(Article $article)
    {
        $article->delete();
---
delete from `articles` where `id` = 53

    public function byAuthor(User $author)
    {
        // $articles = Article::whereUserId($id)->latest()->paginate(10);// magicna metoda where(user_id, $id)
        $articles = $author->articles()->with('category', 'tags')->paginate(10);
---
select * from `categories` where `categories`.`id` in (4)
select `tags`.*, `article_tag`.`article_id` as `pivot_article_id`, `article_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `article_tag` on `tags`.`id` = `article_tag`.`tag_id` where `article_tag`.`article_id` in (34)

    public function byTags(Tag $tag)
    {
        $articles = $tag->articles()->with('category', 'author')->paginate(10);
---
select * from `categories` where `categories`.`id` in (1, 2, 5)
select `articles`.*, `article_tag`.`tag_id` as `pivot_tag_id`, `article_tag`.`article_id` as `pivot_article_id` from `articles` inner join `article_tag` on `articles`.`id` = `article_tag`.`article_id` where `article_tag`.`tag_id` = 8 limit 10 offset 0
select count(*) as aggregate from `articles` inner join `article_tag` on `articles`.`id` = `article_tag`.`article_id` where `article_tag`.`tag_id` = 8

    public function byCategory(Category $category)
    {
        $articles = $category->articles()->with('tags', 'author')->paginate(10);
---
select * from `articles` where `articles`.`category_id` = 4 and `articles`.`category_id` is not null limit 10 offset 0
select `tags`.*, `article_tag`.`article_id` as `pivot_article_id`, `article_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `article_tag` on `tags`.`id` = `article_tag`.`tag_id` where `article_tag`.`article_id` in (31, 32, 33, 34, 35, 36, 37, 38, 39, 40)
select count(*) as aggregate from `articles` where `articles`.`category_id` = 4 and `articles`.`category_id` is not null