laravel-cms/app/Http/Controllers/ArticleController.php

select * from `users` where `users`.`id` in (9, 14, 19, 22, 23, 28, 33, 34, 39, 43)
select * from `users` where `users`.`id` in (1, 10, 12, 20, 28, 30, 35, 43)
---
    public function byAuthor(int $id)
    {
        $user = User::where('id', $id)->firstOrFail();
        $articles = $user->articles()->with('author', 'tags')->latest()->paginate(10);