laravel-cms/app/Http/Controllers/HomeController.php

select * from `articles` where `featured` = 1 limit 1
select * from `articles` order by `created_at` desc limit 2
select * from `categories` where `categories`.`id` in (4)
select * from `articles` order by RAND() limit 9 offset 0
select * from `categories` where `categories`.`id` in (1, 3, 4, 5)
select count(*) as aggregate from `articles`
---
    public function index()
    {
        $featured = Article::where('featured', true)->first();
        $latest = Article::with('author', 'category')->latest()->limit(2)->get();
        $articles = Article::inRandomOrder()->with('author', 'category')->paginate(9);