laravel-cms/app/Http/Controllers/TagController.php

    public function store(TagRequest $request)
    {
        $tags = $request->additionalTag;

        if (str_contains($tags , ',')) {
            $tags = explode(',', $tags );
        }

        if (is_array($tags)) {
            foreach ($tags as $tag) {
                Tag::create(['name' => $tag]);
            }
        } else {
            Tag::create(['name' => $tags]);
---
insert into `tags` (`name`, `updated_at`, `created_at`) values ('Buss', '2024-10-06 10:15:32', '2024-10-06 10:15:32')
insert into `tags` (`name`, `updated_at`, `created_at`) values ('adsas', '2024-10-06 10:38:51', '2024-10-06 10:38:51')