laravel-videoteka/app/Http/Controllers/DashboardController.php

    public function index()
    {
        $users = User::all();
        $copies = Copy::join('movies', 'movies.id', '=', 'copies.movie_id')
                ->join('formats', 'formats.id', '=', 'copies.format_id')
                ->select('copies.barcode', 'movies.id as movies_id', 'movies.title', 'movies.year',
                'formats.id as formats_id', 'formats.type', DB::raw('count(movies.id) as amount'))
                ->where('copies.available', 1)
                ->groupBy('copies.barcode', 'movies.id', 'formats.id')
                ->orderBy('movies.title')
                ->get();
        $rentals = Rental::whereNull('return_date')->with('user', 'copies.format', 'copies.movie.price', 'copies.movie.genre')
            ->orderBy('rentals.rental_date', 'desc')->paginate(20);
---
select * from `users`
select `copies`.`barcode`, `movies`.`id` as `movies_id`, `movies`.`title`, `movies`.`year`, `formats`.`id` as `formats_id`, `formats`.`type`, count(movies.id) as amount from `copies` inner join `movies` on `movies`.`id` = `copies`.`movie_id` inner join `formats` on `formats`.`id` = `copies`.`format_id` where `copies`.`available` = 1 group by `copies`.`barcode`, `movies`.`id`, `formats`.`id` order by `movies`.`title` asc
select * from `formats` where `formats`.`id` in (1, 2, 3, 4)
select * from `genres` where `genres`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14)
select * from `movies` where `movies`.`id` in (3, 16, 24, 29, 31, 33, 34, 39, 40, 45, 47, 50, 53, 58, 67, 75, 82, 92, 100, 113, 118, 124)
select * from `prices` where `prices`.`id` in (1, 2, 3)