laravel-videoteka/app/Http/Controllers/UserController.php

select * from `rentals` where `rentals`.`user_id` in (1, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23)
select * from `users` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `users`
---
    public function index()
    {
        $users = User::with(['rentals'])->latest()->paginate(20);